Repository: Aparamonou/Checkers
Catalog: Finish Chekers/Lesson 12/localization/*.lproj/Localizable.strings
Languages: ru

# custom_button_play
source: Play
ru: Играть

# custom_button_settings
source: Settings
ru: Настройки

# custom_button_result
source: Result
ru: Результаты

# continue_the_game
source: Do you want to continue the saved game
ru: Хотите продолжить сохраненную игру?

# button_new_game
source: New game
ru: Новая игра

# button_resume_game
source: Resume
ru: Продолжить

# label_name_alert_Error
source: Names not entered
ru: Имя не введено

# label_name_alert
source: Enter players names
ru: Введите имя игроков

# textFieldPlayerOne_placeholder
source: Player One
ru: Игрок номер один

# textFieldPlayerTwo_placeholder
source: Player Two
ru: Игрок номер два

# button_Enter_Alert
source: Enter
ru: Далее

# button_Cancel_Alert
source: Cancel
ru: Отмена

# label_Game_Time
source: Game time
ru: Время игры

# button_Back_Main_Menu
source: Back main menu
ru: Назад в меню

# alert_title_save
source: Save game?
ru: Сохранить игру?

# alert_button_Yes
source: Yes
ru: Да

# alert_button_No
source: No
ru: Нет

# alert_wingame_title
source: (winnerPlayer) Won,Game time - (countTickMin) Min
ru: (winnerPlayer) Выйграл, Время игры - (countTickMin) Мин

# alert_button_back_memnu
source: back menu
ru: Назад в меню

# labal_name_white
source: 's turn
ru: ходит

# lable_Language
source: Language
ru: Язык

# label_Style_Chekers
source: Cheker's Style
ru: Стиль шашек

# button_Upload_Background
source: Upload background
ru: Загрузить фон

# button_Cheker_History
source: Cheker's history
ru: История шашек

# label_history_cheker
source: History of Checkers Easily Explained
ru: История шашек легко объясняется

# label_text_one
source: While the oldest known Checkers artifact unearthed in Iraq dates back to 3000 BC, the earliest known version of the game comes from a game called Alquerque, which was played in ancient Egypt in 1400 BC. After years of being played the Egyptian way, in 1100 AD, a Frenchman adapted it to be played on a Chessboard with 12 pieces per player. Then, in 1756 an English mathematician created official rules for the game, and in 1840 was the start of the very first World Championships. Arthur Samuel then created a computerized Checkers program in 1952, which helped turn Checkers into the global phenomenon it is today. In 2007, the game was “solved” by a team of researchers from the University of Alberta (in Canada) led by Jonathan Schaeffer.
ru: В то время как самый старый известный артефакт Шашки, обнаруженный в Ираке, датируется 3000 годом до нашей эры, самая ранняя известная версия игры происходит от игры под названием Alquerque, в которую играли в Древнем Египте в 1400 году до нашей эры. После многих лет игры по египетской манере, в 1100 году нашей эры, француз приспособил ее для игры на шахматной доске с 12 фигурами на игрока. Затем, в 1756 году английский математик создал официальные правила игры, а в 1840 году начался самый первый чемпионат мира. Затем в 1952 году Артур Сэмюэл создал компьютеризированную программу по шашкам, которая помогла превратить шашки в глобальное явление, которым он является сегодня. В 2007 году игра была «решена» группой исследователей из Университета Альберты (в Канаде) во главе с Джонатаном Шеффером.

# label_text_two
source: As you can see, there is not too much depth to the history of Checkers. Who officially created the first version of Checkers is unknown, and even though the oldest Checkers artifact found dates back to 3000 BC, was it perhaps based on a game that has even older origins? There are many unanswered questions when it comes to the history of Checkers. That being said, the history of Checkers is somewhat vague in that no one truly knows its exact origins. There are various ancient games that have a similar concept, and so the history of the game is not quite precise. If you want to learn a little more about the summarized version of the history Checkers mentioned above, read on.
ru: Как видите, в истории шашек не так уж много глубины. Кто официально создал первую версию Шашек, неизвестно, и хотя самый старый найденный артефакт Шашек датируется 3000 годом до нашей эры, возможно, он был основан на игре, имеющей еще более древнее происхождение? Когда дело доходит до истории шашек, остается много вопросов, на которые нет ответа. При этом история Checkers несколько расплывчата, поскольку никто не знает ее точного происхождения. Существуют различные древние игры с похожей концепцией, поэтому история игры не совсем точна. Если вы хотите узнать немного больше о обобщенной версии упомянутых выше средств проверки истории, читайте дальше.

# label_delete_button
source: Delete result
ru: Удалить результаты
